Exercise:kNN

Using the Titanic data: Create a kNN model Report accuracy when number of neighbors = {1, 3, 5, 7}. Pick the best k value and then change the weighted distance metric. Report if distance weighting helps or not.

In [1]:
# importing required libraries
import pandas as pd

In [5]:
train = pd.read_csv('titanic-train.csv')
train.shape

(891, 11)

In [7]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
test = pd.read_csv('titanic-test.csv')
test.shape

(418, 11)

In [9]:
test

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,?,3,male,34.5,0,0,330911,7.8292,NaN,Q
1,893,?,3,female,47.0,1,0,363272,7.0000,NaN,S
2,894,?,2,male,62.0,0,0,240276,9.6875,NaN,Q
3,895,?,3,male,27.0,0,0,315154,8.6625,NaN,S
4,896,?,3,female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,?,3,male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,?,1,female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,?,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,?,3,male,NaN,0,0,359309,8.0500,NaN,S
417,1309,?,3,male,NaN,1,1,2668,22.3583,NaN,C